TexasInstruments/c2000ware-core-sdk/device_support/f2806x/examples/c28/bl_app/deprecated/usblib/device/usbdhid.c
const tConfigSection g_sHIDInEndpointSection =
{
	sizeof(g_pHIDInEndpoint) & 0xFF,
	(sizeof(g_pHIDInEndpoint) & 0xFF00) >> 8,
    g_pHIDInEndpoint
};

const tConfigSection g_sHIDOutEndpointSection =
{
	sizeof(g_pHIDOutEndpoint) & 0xFF,
	(sizeof(g_pHIDOutEndpoint) & 0xFF00) >> 8,
    g_pHIDOutEndpoint
};

//*****************************************************************************
//
// Place holder for the user's HID descriptor block.
//
//*****************************************************************************
tConfigSection g_sHIDDescriptorSection =
{
    0,0, (void *)0
};

//*****************************************************************************
//
// This array lists all the sections that must be concatenated to make a
// single, complete HID configuration descriptor.
//
//*****************************************************************************
const tConfigSection *g_psHIDSections[] =
{
    &g_sHIDConfigSection,
    &g_sHIDInterfaceSection,
    &g_sHIDDescriptorSection,
    &g_sHIDInEndpointSection,
    &g_sHIDOutEndpointSection
};

#define NUM_HID_SECTIONS (sizeof(g_psHIDSections) /                         \
                          sizeof(tConfigSection *))

//*****************************************************************************
//
// The header for the single configuration we support.  This is the root of
// the data structure that defines all the bits and pieces that are pulled
// together to generate the configuration descriptor.  Note that this must be
// in RAM since we need to include or exclude the final section based on
// client supplied initialization parameters.
//
//*****************************************************************************
tConfigHeader g_sHIDConfigHeader =
{
    NUM_HID_SECTIONS,
    g_psHIDSections
};

//*****************************************************************************
//
// Configuration Descriptor.
//
//*****************************************************************************
const tConfigHeader * const g_pHIDConfigDescriptors[] =
{
    &g_sHIDConfigHeader
};

//*****************************************************************************
//
// Forward references for device handler callbacks
//
//*****************************************************************************
static void HandleGetDescriptor(void *pvInstance, tUSBRequest *pUSBRequest);
static void HandleRequest(void *pvInstance, tUSBRequest *pUSBRequest);
static void HandleConfigChange(void *pvInstance, unsigned long ulInfo);
static void HandleEP0DataReceived(void *pvInstance, unsigned long ulInfo);
static void HandleEP0DataSent(void *pvInstance, unsigned long ulInfo);
static void HandleReset(void *pvInstance);
static void HandleSuspend(void *pvInstance);
static void HandleResume(void *pvInstance);
static void HandleDisconnect(void *pvInstance);
static void HandleEndpoints(void *pvInstance, unsigned long ulStatus);
static void HandleDevice(void *pvInstance, unsigned long ulRequest,
                         void *pvRequestData);

//*****************************************************************************
//
// The device information structure for the USB HID devices.
//
//*****************************************************************************
tDeviceInfo g_sHIDDeviceInfo =
{
    //
    // Device event handler callbacks.
    //
    {
        HandleGetDescriptor,   // GetDescriptor
        HandleRequest,         // RequestHandler
        0,                     // InterfaceChange
        HandleConfigChange,    // ConfigChange
        HandleEP0DataReceived, // DataReceived
        HandleEP0DataSent,     // DataSentCallback
        HandleReset,           // ResetHandler
        HandleSuspend,         // SuspendHandler
        HandleResume,          // ResumeHandler
        HandleDisconnect,      // DisconnectHandler
        HandleEndpoints,       // EndpointHandler
        HandleDevice           // Device handler.
    },
    g_pHIDDeviceDescriptor,
    g_pHIDConfigDescriptors,
    0,                         // Will be completed during USBDHIDInit().
    0,                         // Will be completed during USBDHIDInit().
    &g_sUSBDefaultFIFOConfig
};

//*****************************************************************************
//
// Set or clear deferred operation flags in an "atomic" manner.
//
// \param pusDeferredOp points to the flags variable which is to be modified.
// \param usBit indicates which bit number is to be set or cleared.
// \param bSet indicates the state that the flag must be set to.  If \b true,
// the flag is set, if \b false, the flag is cleared.
//
// This function safely sets or clears a bit in a flag variable.  The operation
// makes use of bitbanding to ensure that the operation is atomic (no read-
// modify-write is required).
//
// \return None.
//
//*****************************************************************************
static void
SetDeferredOpFlag(volatile unsigned short *pusDeferredOp,
                  unsigned short usBit, tBoolean bSet)
{
    //
    // Set the flag bit to 1 or 0 using a bitband access.
    //
//    HWREGBITH(pusDeferredOp, usBit) = bSet ? 1 : 0;
    HWREGH(pusDeferredOp) = (HWREGH(pusDeferredOp) & ~(1 << usBit)) | ((bSet ? 1 : 0)<<usBit);
}

//*****************************************************************************
//
// This function is called to clear the counter used to keep track of the time
// elapsed since a given report was last sent.
//
// \param psDevice points to the HID device structure whose report timer is to
// be cleared.
// \param ucReportID is the first byte of the report to be sent.  If this
// device offers more than one input report, this value is used to find the
// relevant report timer structure in the psDevice structure.
//
// \return None.
//
//*****************************************************************************
static void
ClearReportTimer(const tUSBDHIDDevice *psDevice, unsigned char ucReportID)
{
    unsigned long ulLoop;

    if(psDevice->ucNumInputReports > 1)
    {
        //
        // We have more than 1 input report so the report must begin with a
        // byte containing the report ID.  Scan the table we were provided
        // when the device was initialized to find the entry for this report.
        //
        for(ulLoop = 0; ulLoop < psDevice->ucNumInputReports; ulLoop++)
        {
            if(psDevice->psReportIdle[ulLoop].ucReportID == ucReportID)
            {
                break;
            }
        }
    }
    else
    {
        ulLoop = 0;
    }

    //
    // If we drop out of the loop with an index less than ucNumInputReports,
    // we found the relevant report so clear its timer.
    //
    if(ulLoop < psDevice->ucNumInputReports)
    {
        psDevice->psReportIdle[ulLoop].ulTimeSinceReportmS = 0;
    }
}

//*****************************************************************************
//
// This function is called to clear the idle period timers for each input
// report supported by the device.
//
// \param psDevice points to the HID device structure whose timers are to be
// cleared.
// \param ulTimemS is the elapsed time in milliseconds since the last call
// to this function.
//
// \return None.
//
//*****************************************************************************
static void
ClearIdleTimers(const tUSBDHIDDevice *psDevice)
{
    unsigned long ulLoop;

    //
    // Clear the "time till next report" counters for each input report.
    //
    for(ulLoop = 0; ulLoop < psDevice->ucNumInputReports; ulLoop++)
    {
        psDevice->psReportIdle[ulLoop].usTimeTillNextmS =
            psDevice->psReportIdle[ulLoop].ucDuration4mS * 4;
    }
}

//*****************************************************************************
//
// This function is called periodically to allow us to process the report idle
// timers.
//
// \param psDevice points to the HID device structure whose timers are to be
// updated.
// \param ulElapsedmS indicates the number of milliseconds that have elapsed
// since the last call to this function.
//
// \return None.
//
//*****************************************************************************
static void
ProcessIdleTimers(const tUSBDHIDDevice *psDevice, unsigned long ulElapsedmS)
{
    unsigned long ulLoop;
    unsigned long ulSizeReport;
    void *pvReport;
    tHIDInstance *psInst;
    tBoolean bDeferred;

    //
    // Get our instance data pointer
    //
    psInst = ((tUSBDHIDDevice *)psDevice)->psPrivateHIDData;

    //
    // We have not had to defer any report transmissions yet.
    //
    bDeferred = false;

    //
    // Look at each of the input report idle timers in turn.
    //
    for(ulLoop = 0; ulLoop < psDevice->ucNumInputReports; ulLoop++)
    {
        //
        // Update the time since the last report was sent.
        //
        psDevice->psReportIdle[ulLoop].ulTimeSinceReportmS += ulElapsedmS;

        //
        // Is this timer running?
        //
        if(psDevice->psReportIdle[ulLoop].ucDuration4mS)
        {
            //
            // Yes - is it about to expire?
            //
            if(psDevice->psReportIdle[ulLoop].usTimeTillNextmS <= ulElapsedmS)
            {
                //
                // The timer is about to expire.  Can we send a report right
                // now?
                //
                if((psInst->eHIDTxState == HID_STATE_IDLE) &&
                        (psInst->bSendInProgress == false))
                {
                    //
                    // We can send a report so send a message to the
                    // application to retrieve its latest report for
                    // transmission to the host.
                    //
                    ulSizeReport = psDevice->pfnRxCallback(
                                       psDevice->pvRxCBData,
                                       USBD_HID_EVENT_IDLE_TIMEOUT,
                                       psDevice->psReportIdle[ulLoop].ucReportID,
                                       &pvReport);

                    //
                    // Schedule the report for transmission.
                    //
                    USBDHIDReportWrite((void *)psDevice, pvReport,
                                       ulSizeReport, true);

                    //
                    // Reload the timer for the next period.
                    //
                    psDevice->psReportIdle[ulLoop].usTimeTillNextmS =
                        psDevice->psReportIdle[ulLoop].ucDuration4mS * 4;
                }
                else
                {
                    //
                    // We can't send the report straight away so flag it for
                    // transmission as soon as the previous transmission ends.
                    //
                    psDevice->psReportIdle[ulLoop].usTimeTillNextmS = 0;
                    bDeferred = true;
                }
            }
            else
            {
                //
                // The timer is not about to expire.  Update the time till the
                // next report transmission.
                //
                psDevice->psReportIdle[ulLoop].usTimeTillNextmS -= ulElapsedmS;
            }
        }
    }

    //
    // If we had to defer transmission of any report, remember this so that we
    // will process it as soon as possible.
    //
    SetDeferredOpFlag(&psInst->usDeferredOpFlags,
                      HID_DO_SEND_IDLE_REPORT, bDeferred);
}

static void
SetIdleTimeout(const tUSBDHIDDevice *psDevice, unsigned char ucReportID,
               unsigned char ucTimeout4mS)
{
    unsigned long ulLoop;
    tBoolean bReportNeeded;
    tHIDReportIdle *psIdle;

    //
    // Remember that we have not found any report that needs to be sent
    // immediately.
    //
    bReportNeeded = false;

    //
    // Search through all the input reports looking for ones that fit the
    // requirements.
    //
    for(ulLoop = 0; ulLoop < psDevice->ucNumInputReports; ulLoop++)
    {
        psIdle = &psDevice->psReportIdle[ulLoop];

        //
        // If the report ID passed matches the report ID in the idle timer
        // control structure or we were passed a report ID of zero, which
        // indicates that all timers are to be set...
        //
        if(!ucReportID || (ucReportID == psIdle->ucReportID))
        {
            //
            // Save the new duration for the idle timer.
            //
            psIdle->ucDuration4mS = ucTimeout4mS;

            //
            // Are we enabling the idle timer?  If so, fix up the time until it
            // needs to fire.
            //
            if(ucTimeout4mS)
            {
                //
                // Determine what the timeout is for this report given the time
                // since the last report of this type was sent.
                //
                if(psIdle->ulTimeSinceReportmS >=
                        ((unsigned long)ucTimeout4mS * 4))
                {
                    psIdle->usTimeTillNextmS = 0;
                    bReportNeeded = true;
                }
                else
                {
                    psIdle->usTimeTillNextmS =
                        (((unsigned short)ucTimeout4mS * 4) -
                         psIdle->ulTimeSinceReportmS);
                }
            }
        }
    }

    //
    // If we get to here and bReportNeeded is true, this means we need to
    // send back at least one of the input reports as soon as possible.  Try
    // to do this immediately.
    //
    if(bReportNeeded)
    {
        ProcessIdleTimers(psDevice, 0);
    }
}

//*****************************************************************************
//
// Find the idle timeout for a given HID input report.
//
// \param psDevice points to the HID device whose report idle timeout is to be
// found.
// \param ucReportID identifies the report whose timeout is requested.  If 0,
// the timeout for the first report is returns, regardless of its ID (or
// whether it has one).
//
// This function returns the current idle timeout for a given HID input report.
// The value returned is expressed in terms of 4mS intervals.  Convert to
// milliseconds by multiplying by 4.  If the return value is 0, this indicates
// that an infinite timeout is currently set and the device will not send the
// report unless a state change occurs.
//
// \return Returns the current idle timeout for the given report.
//
//*****************************************************************************
static unsigned long
GetIdleTimeout(const tUSBDHIDDevice *psDevice, unsigned char ucReportID)
{
    unsigned long ulLoop;
    tHIDReportIdle *psIdle;

    //
    // Search through all the input reports looking for ones that fit the
    // requirements.
    //
    for(ulLoop = 0; ulLoop < psDevice->ucNumInputReports; ulLoop++)
    {
        psIdle = &psDevice->psReportIdle[ulLoop];

        //
        // If the report ID passed matches the report ID in the idle timer
        // control structure or we were passed a report ID of zero, which
        // indicates that all timers are to be set...
        //
        if(!ucReportID || (ucReportID == psIdle->ucReportID))
        {
            //
            // We found a report matching the required ID or we were not passed
            // an ID and we are looking at the first report information.
            //
            return((unsigned long)psIdle->ucDuration4mS);
        }
    }

    //
    // If we drop out, the report couldn't be found so we need to indicate
    // an error.
    //
    return(HID_NOT_FOUND);
}

//*****************************************************************************
//
// Find the n-th HID class descriptor of a given type in the client-provided
// descriptor table.
//
// \param psDevice points to the HID device which is to be searched for the
// required class descriptor.
// \param ucType is the type of class descriptor being requested.  This will
// be either USB_HID_DTYPE_REPORT or USB_HID_DTYPE_PHYSICAL.
// \param ulIndex is the zero-based index of the descriptor that is being
// requested.
//
// This function parses the supplied HID descriptor to find the index into the
// sClassDescriptor array that corresponds to the requested descriptor.  If
// a descriptor with the requested index does not exist, HID_NOT_FOUND will be
// returned unless the request is for a physical descriptor and at least one
// such descriptor exists.  In this case, the index returned will be for the
// last physical descriptor (as required by the HID spec 7.1.1).
//
// \return Returns the index of the descriptor within the sClassDescriptor
// of the tHIDDevice structure if found or HID_NOT_FOUND otherwise.
//
//*****************************************************************************
static unsigned long
FindHIDDescriptor(const tUSBDHIDDevice *psDevice, unsigned char ucType,
                  unsigned long ulIndex, unsigned long *pulLen)
{
    tBoolean bFoundType;
    unsigned long ulLoop;
    unsigned long ulCount;
    unsigned long ulLastFound;
    const tHIDClassDescriptorInfo *psDesc;

    //
    // Remember that we have not found any descriptor with a matching type yet.
    //
    bFoundType = false;
    ulCount = 0;
    ulLastFound = 0;

    //
    // Walk through all the class descriptors looking for the one which
    // matches the requested index and type.
    //
    for(ulLoop = 0; ulLoop < psDevice->psHIDDescriptor->bNumDescriptors;
            ulLoop++)
    {
        psDesc = &(psDevice->psHIDDescriptor->sClassDescriptor[ulLoop]);
        if(psDesc->bDescriptorType == ucType)
        {
            //
            // We found a descriptor of the correct type.  Is this the
            // correct index?
            //
            bFoundType = true;

            //
            // Is this the descriptor we are looking for?
            //
            if(ulCount == ulIndex)
            {
                //
                // Yes - we found it so return the index and size to the
                // caller.
                //
                *pulLen = (unsigned long)readShort(&(psDesc->wDescriptorLength));
                return(ulLoop);
            }
            else
            {
                //
                // Update our count and keep looking.  Remember where we were
                // when we found this descriptor in case we need to return the
                // last physical descriptor.
                //
                ulCount++;
                ulLastFound = ulLoop;
            }
        }
    }

    //
    // If we drop out, we didn't find the requested descriptor.  Now handle
    // the special case of a physical descriptor - if we found any physical
    // descriptors, return the last one.
    //
    if((ucType == USB_HID_DTYPE_PHYSICAL) && bFoundType)
    {
        //
        // Get the length of the last descriptor we found.
        //
        psDesc = &(psDevice->psHIDDescriptor->sClassDescriptor[ulLastFound]);
        *pulLen = (unsigned long)readShort(&(psDesc->wDescriptorLength));

        //
        // Return the index to the caller.
        //
        return(ulLastFound);
    }
    else
    {
        //
        // We couldn't find the descriptor so return an appropriate error.
        //
        return(HID_NOT_FOUND);
    }
}

//*****************************************************************************
//
// Schedule transmission of the next packet forming part of an input report.
//
// \param psInst points to the device instance whose input report is to be
// sent.
//
// This function is called to transmit the next packet of an input report
// passed to the driver via a call to USBDHIDReportWrite.  If any data remains
// to be sent, a USB packet is written to the FIFO and scheduled for
// transmission to the host.  The function ensures that reports are sent as
// a sequence of full packets followed by either a single short packet or a
// packet with no data to indicate the end of the transaction.
//
//*****************************************************************************
static long
ScheduleReportTransmission(tHIDInstance *psInst)
{
    unsigned long ulNumBytes;
    unsigned char *pucData;
    long lRetcode;

    //
    // Set the number of bytes to send this iteration.
    //
    ulNumBytes = (unsigned long)(psInst->usInReportSize -
                                 psInst->usInReportIndex);

    //
    // Limit individual transfers to the maximum packet size for the endpoint.
    //
    if(ulNumBytes > INT_IN_EP_MAX_SIZE)
    {
        ulNumBytes = INT_IN_EP_MAX_SIZE;
    }

    //
    // Where are we sending this data from?
    //
    pucData = psInst->pucInReportData + psInst->usInReportIndex;

    //
    // Put the data in the correct FIFO.
    //
    lRetcode = USBEndpointDataPut(psInst->ulUSBBase, psInst->ucINEndpoint,
                                  pucData, ulNumBytes);

    if(lRetcode != -1)
    {
        //
        // Update the count and index ready for the next time round.
        //
        psInst->usInReportIndex += ulNumBytes;

        //
        // Send out the current data.
        //
        lRetcode = USBEndpointDataSend(psInst->ulUSBBase,
                                           psInst->ucINEndpoint,
                                       USB_TRANS_IN);
    }

    //
    // Tell the caller how we got on.
    //
    return(lRetcode);
}

//*****************************************************************************
//
// Receives notifications related to data received from the host.
//
// \param psDevice is the device instance whose endpoint is to be processed.
// \param ulStatus is the USB interrupt status that caused this function to
// be called.
//
// This function is called from HandleEndpoints for all interrupts signaling
// the arrival of data on the interrupt OUT endpoint (in other words, whenever
// the host has sent us a packet of data).  We inform the client that a packet
// is available and, on return, check to see if the packet has been read.  If
// not, we schedule another notification to the client for a later time.
//
// \return Returns \b true on success or \b false on failure.
//
//*****************************************************************************
static tBoolean
ProcessDataFromHost(const tUSBDHIDDevice *psDevice, unsigned long ulStatus)
{
    unsigned long ulEPStatus;
    unsigned long ulSize;
    tHIDInstance *psInst;

    //
    // Get a pointer to our instance data.
    //
    psInst = psDevice->psPrivateHIDData;

    //
    // Get the endpoint status to see why we were called.
    //
    ulEPStatus = USBEndpointStatus(USB0_BASE, psInst->ucOUTEndpoint);

    //
    // Clear the status bits.
    //
    USBDevEndpointStatusClear(USB0_BASE, psInst->ucOUTEndpoint, ulEPStatus);

    //
    // Has a packet been received?
    //
    if(ulEPStatus & USB_DEV_RX_PKT_RDY)
    {
        //
        // Set the flag we use to indicate that a packet read is pending.  This
        // will be cleared if the packet is read.  If the client doesn't read
        // the packet in the context of the USB_EVENT_RX_AVAILABLE callback,
        // the event will be signaled later during tick processing.
        //
        SetDeferredOpFlag(&psInst->usDeferredOpFlags, HID_DO_PACKET_RX, true);

        //
        // How big is the packet we've just been sent?
        //
        ulSize = USBEndpointDataAvail(psInst->ulUSBBase,
                                      psInst->ucOUTEndpoint);

