TexasInstruments/c2000ware-core-sdk/device_support/f2806x/examples/c28/bl_app/deprecated/usblib/device/usbdhid.c
    switch(ulRequest)
    {
        //
        // This was an interface change event.
        //
    case USB_EVENT_COMP_IFACE_CHANGE:
    {
        psInst->ucInterface = pucData[1];
        break;
    }

    //
    // This was an endpoint change event.
    //
    case USB_EVENT_COMP_EP_CHANGE:
    {
        //
        // Determine if this is an IN or OUT endpoint that has changed.
        //
        if(pucData[0] & USB_EP_DESC_IN)
        {
            psInst->ucINEndpoint =
                INDEX_TO_USB_EP((pucData[1] & 0x7f));
        }
        else
        {
            //
            // Extract the new endpoint number.
            //
            psInst->ucOUTEndpoint =
                INDEX_TO_USB_EP(pucData[1] & 0x7f);
        }
        break;
    }
    default:
    {
        break;
    }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the device is
// disconnected from the host.
//
//*****************************************************************************
static void
HandleDisconnect(void *pvInstance)
{
    const tUSBDHIDDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Create the instance pointer.
    //
    psDevice = (const tUSBDHIDDevice *)pvInstance;

    //
    // If we are not currently connected so let the client know we are open
    // for business.
    //
    if(psDevice->psPrivateHIDData->bConnected)
    {
        //
        // Pass the disconnected event to the client.
        //
        psDevice->pfnRxCallback(psDevice->pvRxCBData, USB_EVENT_DISCONNECTED,
                                0, (void *)0);
    }

    //
    // Remember that we are no longer connected.
    //
    psDevice->psPrivateHIDData->bConnected = false;
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever a request for a
// non-standard descriptor is received.
//
// \param pvInstance is the instance data for this request.
// \param pUSBRequest points to the request received.
//
// This call parses the provided request structure and determines which
// descriptor is being requested.  Assuming the descriptor can be found, it is
// scheduled for transmission via endpoint zero.  If the descriptor cannot be
// found, the endpoint is stalled to indicate an error to the host.
//
//*****************************************************************************
static void
HandleGetDescriptor(void *pvInstance, tUSBRequest *pUSBRequest)
{
    unsigned long ulSize;
    unsigned long ulDesc;
    const tUSBDHIDDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Which device are we dealing with?
    //
    psDevice = pvInstance;

    //
    // Which type of class descriptor are we being asked for?
    //
    switch(readShort(&(pUSBRequest->wValue)) >> 8)
    {
        //
        // This is a request for a HID report or physical descriptor.
        //
    case USB_HID_DTYPE_REPORT:
    case USB_HID_DTYPE_PHYSICAL:
    {
        //
        // Find the index to the descriptor that is being queried.
        //
        ulSize = 0;
        ulDesc = FindHIDDescriptor(psDevice, readShort(&(pUSBRequest->wValue)) >> 8,
                                   readShort(&(pUSBRequest->wValue)) & 0xFF,
                                   &ulSize);


        //
        // Did we find the descriptor?
        //
        if(ulDesc == HID_NOT_FOUND)
        {
            //
            // No - stall the endpoint and return.
            //
            USBDCDStallEP0(0);
            return;
        }

        //
        // If there is more data to send than the host requested then just
        // send the requested amount of data.
        //
        if(ulSize > readShort(&(pUSBRequest->wLength)))
        {
            ulSize = readShort(&(pUSBRequest->wLength));
        }

        //
        // Send the data via endpoint 0.
        //
        USBDCDSendDataEP0(0,
                          (unsigned char *)psDevice->ppClassDescriptors[ulDesc], ulSize);

        break;
    }

    //
    // This is a request for the HID descriptor (as found in the
    // configuration descriptor following the relevant interface).
    //
    case USB_HID_DTYPE_HID:
    {
        //
        // How big is the HID descriptor?
        //
        ulSize = (unsigned long)psDevice->psHIDDescriptor->bLength;

        //
        // If there is more data to send than the host requested then just
        // send the requested amount of data.
        //
        if(ulSize > readShort(&(pUSBRequest->wLength)))
        {
            ulSize = readShort(&(pUSBRequest->wLength));
        }

        //
        // Send the data via endpoint 0.
        //
        USBDCDSendDataEP0(0, (unsigned char *)psDevice->psHIDDescriptor,
                          ulSize);
        break;
    }

    //
    // This was an unknown request so stall.
    //
    default:
    {
        USBDCDStallEP0(0);
        break;
    }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever a non-standard
// request is received.
//
// \param pvInstance is the instance data for this HID device.
// \param pUSBRequest points to the request received.
//
// This call parses the provided request structure.  Assuming the request is
// understood, it is handled and any required response generated.  If the
// request cannot be handled by this device class, endpoint zero is stalled to
// indicate an error to the host.
//
//*****************************************************************************
static void
HandleRequest(void *pvInstance, tUSBRequest *pUSBRequest)
{
    tHIDInstance *psInst;
    unsigned char ucProtocol;
    const tUSBDHIDDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Which device are we dealing with?
    //
    psDevice = pvInstance;

    //
    // Get a pointer to our instance data.
    //
    psInst = psDevice->psPrivateHIDData;

    //
    // Make sure the request was for this interface.
    //
    if(readShort(&(pUSBRequest->wIndex)) != psInst->ucInterface)
    {
        return;
    }

    //
    // Determine the type of request.
    //
    switch(pUSBRequest->bRequest)
    {
        //
        // A Set Report request is received from the host when it sends an
        // Output report via endpoint 0.
        //
    case USBREQ_SET_REPORT:
    {
        //
        // Ask the application for a buffer large enough to hold the
        // report we are to be sent.
        //
        psInst->usOutReportSize = readShort(&(pUSBRequest->wLength));
        psInst->pucOutReportData =
            (unsigned char *)psDevice->pfnRxCallback(
                psDevice->pvRxCBData,
                USBD_HID_EVENT_GET_REPORT_BUFFER,
                readShort(&(pUSBRequest->wValue)),
                (void *)(unsigned long)readShort(&(pUSBRequest->wLength)));

        //
        // Did the client provide us a buffer?
        //
        if(!psInst->pucOutReportData)
        {
            //
            // The application couldn't provide us a buffer so stall the
            // request.
            //
            USBDCDStallEP0(0);
        }
        else
        {
            //
            // The client provided us a buffer to read the report into
            // so request the data from the host.
            //

            //
            // Set the state to indicate we are waiting for data.
            //
            psInst->eHIDRxState = HID_STATE_WAIT_DATA;

            //
            // Now read the payload of the request.  We handle the actual
            // operation in the data callback once this data is received.
            //
            USBDCDRequestDataEP0(0, psInst->pucOutReportData,
                                 (unsigned long)readShort(&(pUSBRequest->wLength)));


            //
            // Need to ACK the data on end point 0 in this case.  Do this
            // after requesting the data to prevent race conditions that
            // occur if you acknowledge before setting up to receive the
            // request data.
            //
                USBDevEndpointDataAck(psInst->ulUSBBase, USB_EP_0, false);
        }

        break;
    }

    //
    // A Get Report request is used by the host to poll a device for its
    // current state.
    //
    case USBREQ_GET_REPORT:
    {
        unsigned long ulSize;
        unsigned char *pucReport;

        //
        // Get the latest report from the application.
        //
        ulSize = psDevice->pfnRxCallback(psDevice->pvRxCBData,
                                         USBD_HID_EVENT_GET_REPORT,
                                         readShort(&(pUSBRequest->wValue)), &pucReport);


        //
        // Need to ACK the data on end point 0 in this case.
        //
        USBDevEndpointDataAck(psInst->ulUSBBase, USB_EP_0, true);

        //
        // ..then send back the requested report.
        //
        psInst->bGetRequestPending = true;
        USBDCDSendDataEP0(0, pucReport, ulSize);

        break;
    }

    //
    // A set IDLE request has been made.  This indicates to us how often a
    // given report should be sent back to the host in the absence of any
    // change in state of the device.
    //
    case USBREQ_SET_IDLE:
    {
        //
        // Set the idle timeout for the requested report(s).
        //
        SetIdleTimeout(psDevice, readShort(&(pUSBRequest->wValue)) & 0xFF,
                       (readShort(&(pUSBRequest->wValue)) >> 8) & 0xFF);


        //
        // Need to ACK the data on end point 0 in this case.
        //
        USBDevEndpointDataAck(psInst->ulUSBBase, USB_EP_0, true);

        break;
    }

    //
    // A get IDLE request has been made.  This request queries the current
    // idle timeout for a given report.
    //
    case USBREQ_GET_IDLE:
    {
        unsigned long ulTimeout;

        //
        // Determine the timeout for the requested report.
        //
        ulTimeout = GetIdleTimeout(psDevice, readShort(&(pUSBRequest->wValue)));

