TexasInstruments/c2000ware-core-sdk/device_support/f2806x/examples/c28/bl_app/deprecated/usblib/device/usbdhid.c
        if(ulTimeout != HID_NOT_FOUND)
        {
            //
            // Need to ACK the data on end point 0 in this case.
            //
            USBDevEndpointDataAck(psInst->ulUSBBase, USB_EP_0, true);

            //
            // Send our response to the host.
            //
            USBDCDSendDataEP0(0, (unsigned char *)&ulTimeout, 1);
        }
        else
        {
            //
            // The report ID was not found so stall the endpoint.
            //
            USBDCDStallEP0(0);
        }
        break;
    }

    //
    // Set either boot or report protocol for reports sent from the device.
    // This is only supported by devices in the boot subclass.
    //
    case USBREQ_SET_PROTOCOL:
    {
        if(psDevice->ucSubclass == USB_HID_SCLASS_BOOT)
        {
            //
            // We need to ACK the data on end point 0 in this case.
            //
            USBDevEndpointDataAck(psInst->ulUSBBase, USB_EP_0, true);

            //
            // We are a boot subclass device so pass this on to the
            // application.
            //
            psDevice->pfnRxCallback(psDevice->pvRxCBData,
                                    USBD_HID_EVENT_SET_PROTOCOL,
                                    readShort(&(pUSBRequest->wValue)),
                                    (void *)0);
        }
        else
        {
            //
            // This is not a boot subclass device so stall the endpoint to
            // show that we don't support this request.
            //
            USBDCDStallEP0(0);
        }
        break;
    }

    //
    // Inform the host of the protocol, boot or report, that is currently
    // in use.  This is only supported by devices in the boot subclass.
    //
    case USBREQ_GET_PROTOCOL:
    {
        if(psDevice->ucSubclass == USB_HID_SCLASS_BOOT)
        {
            //
            // We need to ACK the data on end point 0 in this case.
            //
            USBDevEndpointDataAck(psInst->ulUSBBase, USB_EP_0, true);

            //
            // We are a boot subclass device so pass this on to the
            // application callback to get the answer.
            //
            ucProtocol = (unsigned char)psDevice->pfnRxCallback(
                             psDevice->pvRxCBData, USBD_HID_EVENT_GET_PROTOCOL, 0,
                             (void *)0);

            //
            // Send our response to the host.
            //
            USBDCDSendDataEP0(0, (unsigned char *)&ucProtocol, 1);
        }
        else
        {
            //
            // This is not a boot subclass device so stall the endpoint to
            // show that we don't support this request.
            //
            USBDCDStallEP0(0);
        }
        break;
    }

    //
    // This request was not recognized so stall.
    //
    default:
    {
        USBDCDStallEP0(0);
        break;
    }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the data requested
// on endpoint zero is received.
//
//*****************************************************************************
static void
HandleEP0DataReceived(void *pvInstance, unsigned long ulDataSize)
{
    tHIDInstance *psInst;
    const tUSBDHIDDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Which device are we dealing with?
    //
    psDevice = pvInstance;

    //
    // If we were not passed any data, just return.
    //
    if(ulDataSize == 0)
    {
        return;
    }

    //
    // Get our instance data pointer.
    //
    psInst = psDevice->psPrivateHIDData;

    //
    // Make sure we are actually expecting something.
    //
    if(psInst->eHIDRxState != HID_STATE_WAIT_DATA)
    {
        return;
    }

    //
    // Change the endpoint state back to idle now that we have been passed
    // the data we were waiting for.
    //
    psInst->eHIDRxState = HID_STATE_IDLE;

    //
    // The only things we ever request via endpoint zero are reports sent to
    // us via a Set_Report request.  Pass the newly received report on to
    // the client.
    //
    psDevice->pfnRxCallback(psDevice->pvRxCBData, USBD_HID_EVENT_SET_REPORT,
                            psInst->usOutReportSize,
                            psInst->pucOutReportData);
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the data sent on
// endpoint zero is received and acknowledged by the host.
//
//*****************************************************************************
static void
HandleEP0DataSent(void *pvInstance, unsigned long ulInfo)
{
    tHIDInstance *psInst;
    const tUSBDHIDDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Which device are we dealing with?
    //
    psDevice = pvInstance;

    //
    // Get our instance data pointer.
    //
    psInst = psDevice->psPrivateHIDData;

    //
    // If we just sent a report in response to a Get_Report request, send an
    // event to the application telling it that the transmission completed.
    //
    if(psInst->bGetRequestPending)
    {
        //
        // Clear the flag now that we are sending the application callback.
        //
        psInst->bGetRequestPending = false;

        psDevice->pfnRxCallback(psDevice->pvRxCBData,
                                USBD_HID_EVENT_REPORT_SENT, 0, (void *)0);
    }

    return;
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the device is
// reset.  If we are currently connected, send a disconnect event at this
// point.
//
//*****************************************************************************
static void
HandleReset(void *pvInstance)
{
    ASSERT(pvInstance != 0);

    //
    // Merely call the disconnect handler.  This causes a disconnect message to
    // be sent to the client if we think we are currently connected.
    //
    HandleDisconnect(pvInstance);
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the bus is put into
// suspend state.
//
//*****************************************************************************
static void
HandleSuspend(void *pvInstance)
{
    const tUSBDHIDDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Create the instance pointer.
    //
    psDevice = (const tUSBDHIDDevice *)pvInstance;

    //
    // Pass the event on to the client.
    //
    psDevice->pfnRxCallback(psDevice->pvRxCBData, USB_EVENT_SUSPEND, 0,
                            (void *)0);
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the bus is taken
// out of suspend state.
//
//*****************************************************************************
static void
HandleResume(void *pvInstance)
{
    const tUSBDHIDDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Create the instance pointer.
    //
    psDevice = (const tUSBDHIDDevice *)pvInstance;

    //
    // Pass the event on to the client.
    //
    psDevice->pfnRxCallback(psDevice->pvRxCBData,
                            USB_EVENT_RESUME, 0, (void *)0);
}

//*****************************************************************************
//
// This function is called periodically and provides us with a time reference
// and method of implementing delayed or time-dependent operations.
//
// \param pvInstance is the instance data for this request.
// \param ulTimemS is the elapsed time in milliseconds since the last call
// to this function.
//
// \return None.
//
//*****************************************************************************
static void
HIDTickHandler(void *pvInstance, unsigned long ulTimemS)
{
    tHIDInstance *psInst;
    unsigned long ulSize;
    const tUSBDHIDDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Create the instance pointer.
    //
    psDevice = (const tUSBDHIDDevice *)pvInstance;

    //
    // Get our instance data pointer.
    //
    psInst = psDevice->psPrivateHIDData;

    //
    // If we are connected, process our idle timers.
    //
    if(psInst->bConnected)
    {
        ProcessIdleTimers(psDevice, ulTimemS);
    }

    //
    // Do we have a deferred receive waiting
    //
    if(psInst->usDeferredOpFlags & (1 << HID_DO_PACKET_RX))
    {
        //
        // Yes - how big is the waiting packet?
        //
        ulSize = USBEndpointDataAvail(USB0_BASE, psInst->ucOUTEndpoint);

        //
        // Tell the client that there is a packet waiting for it.
        //
        psDevice->pfnRxCallback(psDevice->pvRxCBData,
                                USB_EVENT_RX_AVAILABLE, ulSize, (void *)0);
    }

    return;
}

//*****************************************************************************
//
//! Initializes HID device operation for a given USB controller.
//!
//! \param ulIndex is the index of the USB controller which is to be
//! initialized for HID device operation.
//! \param psDevice points to a structure containing parameters customizing
//! the operation of the HID device.
//!
//! An application wishing to offer a USB HID interface to a host system
//! must call this function to initialize the USB controller and attach the
//! device to the USB bus.  This function performs all required USB
//! initialization.
//!
//! On successful completion, this function will return the \e psDevice pointer
//! passed to it.  This must be passed on all future calls from the application
//! to the HID device class driver.
//!
//! The USB HID device class API offers the application a report-based transmit
//! interface for Input reports.  Output reports may be received via the
//! control endpoint or via a dedicated Interrupt OUT endpoint.  If using the
//! dedicated endpoint, report data is delivered to the application packet-by-
//! packet.  If the application uses reports longer than 64 bytes and would
//! rather receive full reports, it may use a USB buffer above the receive
//! channel to allow full reports to be read.
//!
//! Transmit Operation:
//!
//! Calls to USBDHIDReportWrite() pass complete reports to the driver for
//! transmission.  These will be transmitted to the host using as many USB
//! packets as are necessary to complete the transmission.
//!
//! Once a full Input report has been acknowledged by the USB host, a
//! USB_EVENT_TX_COMPLETE event is sent to the application transmit callback to
//! inform it that another report may be transmitted.
//!
//! Receive Operation (when using a dedicated interrupt OUT endpoint):
//!
//! An incoming USB data packet will result in a call to the application
//! callback with event USB_EVENT_RX_AVAILABLE.  The application must then
//! call USBDHIDPacketRead(), passing a buffer capable of holding the received
//! packet.  The size of the packet may be determined by calling function
//! USBDHIDRxPacketAvailable() prior to reading the packet.
//!
//! Receive Operation (when not using a dedicated OUT endpoint):
//!
//! If no dedicated OUT endpoint is used, Output and Feature reports are sent
//! from the host using the control endpoint, endpoint zero.  When such a
//! report is received, USBD_HID_EVENT_GET_REPORT_BUFFER is sent to the
//! application which must respond with a buffer large enough to hold the
//! report.  The device class driver will then copy the received report into
//! the supplied buffer before sending USBD_HID_EVENT_SET_REPORT to indicate
//! that the report is now available.
//!
//! \note The application must not make any calls to the low level USB device
//! interface if interacting with USB via the USB HID device class API.  Doing
//! so will cause unpredictable (though almost certainly unpleasant) behavior.
//!
//! \return Returns NULL on failure or the \e psDevice pointer on success.
//
//*****************************************************************************
void *
USBDHIDInit(unsigned long ulIndex, const tUSBDHIDDevice *psDevice)
{
    //
    // Check parameter validity.
    //
    ASSERT(ulIndex == 0);
    ASSERT(psDevice);
    ASSERT(psDevice->ppStringDescriptors);
    ASSERT(psDevice->psPrivateHIDData);
    ASSERT(psDevice->pfnRxCallback);
    ASSERT(psDevice->pfnTxCallback);
    ASSERT(psDevice->ppClassDescriptors);
    ASSERT(psDevice->psHIDDescriptor);
    ASSERT((psDevice->ucNumInputReports == 0) || psDevice->psReportIdle);


    USBDHIDCompositeInit(ulIndex, psDevice);

    //
    // All is well so now pass the descriptors to the lower layer and put
    // the HID device on the bus.
    //
    USBDCDInit(ulIndex, psDevice->psPrivateHIDData->psDevInfo);

    //
    // Return the pointer to the instance indicating that everything went well.
    //
    return((void *)psDevice);
}

//*****************************************************************************
//
//! Initializes HID device operation for a given USB controller.
//!
//! \param ulIndex is the index of the USB controller which is to be
//! initialized for HID device operation.
//! \param psDevice points to a structure containing parameters customizing
//! the operation of the HID device.
//!
//!
//! \return Returns NULL on failure or the \e psDevice pointer on success.
//
//*****************************************************************************
void *
USBDHIDCompositeInit(unsigned long ulIndex, const tUSBDHIDDevice *psDevice)
{
    tHIDInstance *psInst;
    tDeviceDescriptor *psDevDesc;
    tInterfaceDescriptor *psDevIf;

    //
    // Check parameter validity.
    //
    ASSERT(ulIndex == 0);
    ASSERT(psDevice);
    ASSERT(psDevice->ppStringDescriptors);
    ASSERT(psDevice->psPrivateHIDData);
    ASSERT(psDevice->pfnRxCallback);
    ASSERT(psDevice->pfnTxCallback);
    ASSERT(psDevice->ppClassDescriptors);
    ASSERT(psDevice->psHIDDescriptor);
    ASSERT((psDevice->ucNumInputReports == 0) || psDevice->psReportIdle);

    //
    // Initialize the workspace in the passed instance structure.
    //
    psInst = psDevice->psPrivateHIDData;
    psInst->psConfDescriptor = (tConfigDescriptor *)g_pHIDDescriptor;
    psInst->psDevInfo = &g_sHIDDeviceInfo;
    psInst->ulUSBBase = USB0_BASE;
    psInst->eHIDRxState = HID_STATE_UNCONFIGURED;
    psInst->eHIDTxState = HID_STATE_UNCONFIGURED;
    psInst->usDeferredOpFlags = 0;
    psInst->bConnected = false;
    psInst->bGetRequestPending = false;
    psInst->bSendInProgress = false;
    psInst->usInReportIndex = 0;
    psInst->usInReportSize = 0;
    psInst->pucInReportData = (unsigned char *)0;
    psInst->usOutReportSize = 0;
    psInst->pucOutReportData = (unsigned char *)0;

    //
    // Set the default endpoint and interface assignments.
    //
    psInst->ucINEndpoint = INT_IN_ENDPOINT;
    psInst->ucOUTEndpoint = INT_OUT_ENDPOINT;
    psInst->ucInterface = 0;

    //
    // Fix up the device descriptor with the client-supplied values.
    //
    psDevDesc = (tDeviceDescriptor *)psInst->psDevInfo->pDeviceDescriptor;
    writeShort(&(psDevDesc->idVendor), psDevice->usVID);
    writeShort(&(psDevDesc->idProduct), psDevice->usPID);

    //
    // Fix up the configuration descriptor with client-supplied values.
    //
    psInst->psConfDescriptor->bmAttributes = psDevice->ucPwrAttributes;
    psInst->psConfDescriptor->bMaxPower =
        (unsigned char)(psDevice->usMaxPowermA / 2);

    //
    // Slot the client's HID descriptor into our standard configuration
    // descriptor.
    //
    writeShort(&(g_sHIDDescriptorSection.usSize), psDevice->psHIDDescriptor->bLength);
    g_sHIDDescriptorSection.pucData =
        (unsigned char *)psDevice->psHIDDescriptor;

    //
    // Fix up the interface and endpoint descriptors depending upon client
    // choices.
    //
    psDevIf = (tInterfaceDescriptor *)g_pHIDInterface;
    psDevIf->bNumEndpoints = psDevice->bUseOutEndpoint ? 2 : 1;
    psDevIf->bInterfaceSubClass = psDevice->ucSubclass;
    psDevIf->bInterfaceProtocol = psDevice->ucProtocol;

    //
    // If necessary, remove the interrupt OUT endpoint from the configuration
    // descriptor.
    //
    if(psDevice->bUseOutEndpoint == false)
    {
        g_sHIDConfigHeader.ucNumSections = (NUM_HID_SECTIONS - 1);
    }
    else
    {
        g_sHIDConfigHeader.ucNumSections = NUM_HID_SECTIONS;
    }

    //
    // Plug in the client's string table to the device information
    // structure.
    //
    psInst->psDevInfo->ppStringDescriptors = psDevice->ppStringDescriptors;
    psInst->psDevInfo->ulNumStringDescriptors
    = psDevice->ulNumStringDescriptors;
    psInst->psDevInfo->pvInstance = (void *)psDevice;

    //
    // Initialize the input report idle timers if any input reports exist.
    //
    ClearIdleTimers(psDevice);

    //
    // Initialize the USB tick module, this will prevent it from being
    // initialized later in the call to USBDCDInit();
    //
    InternalUSBTickInit();

    //
    // Register our tick handler (this must be done after USBDCDInit).
    //
    InternalUSBRegisterTickHandler(HIDTickHandler,
                                   (void *)psDevice);

    //
    // Return the pointer to the instance indicating that everything went well.
    //
    return((void *)psDevice);
}

//*****************************************************************************
//
//! Shuts down the HID device.
//!
//! \param pvInstance is the pointer to the device instance structure as
//! returned by USBDHIDInit().
//!
//! This function terminates HID operation for the instance supplied and
//! removes the device from the USB bus.  This function should not be called
//! if the HID device is part of a composite device and instead the
//! USBDCompositeTerm() function should be called for the full composite
//! device.
//!
//! Following this call, the \e pvInstance instance should not me used in any
//! other calls.
//!
//! \return None.
//
//*****************************************************************************
void
USBDHIDTerm(void *pvInstance)
{
    tHIDInstance *psInst;

